

function Foot() {
  return (
    <div className="bg-white px-4 pt-[55px] lg:px-[375px]">
        <h2 className="footh2 lg:w-[326px]">Как снять квартиру на сутки в Минске?</h2>
        <div className="lg:flex">
        <div className="flex mt-[57px] gap-[6px] pl-[52px] lg:pt-16 lg:pl-0">
            <h1 className="foot1">1</h1>
            <div className="w-[270px] pt-7 ">
                <h2 className="footh21">Позвонить </h2>
                <p className="ft">Ha нашем сайте размещены прямые телефоны, актуальная информация и реальная цена аренды.</p>
            </div>
        </div>
        <div className="flex mt-[57px] gap-[6px] pl-[72px]">
            <h1 className="foot1  text-[29px]">2</h1>
            <div className="w-[270px] pt-7 ">
                <h2 className="footh21">Позвонить </h2>
                <p className="ft">Ha нашем сайте размещены прямые телефоны, актуальная информация и реальная цена аренды.</p>
            </div>
        </div>
        <div className="flex mt-[57px] gap-[6px] pl-[52px] lg:pt-16">
            <h1 className="foot1">3</h1>
            <div className="w-[270px] pt-7 ">
                <h2 className="footh21">Позвонить </h2>
                <p className="ft">На нашем сайте размещены прямые телефоны, актуальная информация и реальная цена аренды.</p>
            </div>
        </div>
        </div>
        <div className="flex justify-between mt-[59px] lg:w-[466px] lg:mb-[-70px]"> 
                <p className="ftp">Квартиры на сутки</p>
                <p className="ftp">Аренда авто</p>
                <p className="ftp">Коттеджи</p>
                <p className="ftp hidden lg:block">Почасовые</p>
                <p className="ftp hidden lg:block">Блог</p>
        </div>
        <div className="flex justify-between mt-[30px] lg:justify-end"> 
                <p className="ftp lg:hidden">Почасовые</p>
                <p className="ftp lg:hidden">Блог</p>
                <p className="ftp flex gap-1"> <span className="bg-[#000] text-white h-4 w-4 rounded-full block text-center">+</span> Добавить объявление</p>
        </div>
        <div className="flex justify-between items-center mt-[47px]">
        <svg xmlns="http://www.w3.org/2000/svg" width="103" height="57" viewBox="0 0 103 57" fill="none">
            <path fillRule="evenodd" clipRule="evenodd" d="M22.123 36.224V56.9292H24.1142C28.4152 56.9292 32.3178 56.2655 35.8223 54.938C39.3268 53.5575 42.3268 51.6459 44.8224 49.2034C47.318 46.7078 49.2295 43.7343 50.557 40.283C51.9375 36.7785 52.6278 32.8758 52.6278 28.5749C52.6278 24.6987 52.0172 21.0615 50.7959 17.6633C49.5747 14.2119 47.7693 11.2119 45.3799 8.66316C42.9905 6.11446 40.017 4.09674 36.4595 2.61C32.9019 1.12325 28.7868 0.379883 24.1142 0.379883H22.123V10.4678H28.4039C30.1305 10.4678 31.7243 10.8517 33.1853 11.6195C34.6463 12.3524 35.8914 13.3296 36.9208 14.5511C37.9833 15.7377 38.8134 17.1162 39.4111 18.6867C40.0088 20.2223 40.3076 21.7754 40.3076 23.3459C40.3076 25.5097 39.8593 27.5339 38.9628 29.4185C38.0663 31.2682 36.8211 32.7864 35.2273 33.973L42.6983 47.6363H31.7409L25.5151 36.224H22.123ZM22.123 27.3245H28.0054C28.6031 27.3245 29.151 26.9755 29.649 26.2775C30.1803 25.5795 30.4459 24.6023 30.4459 23.3459C30.4459 22.0546 30.1471 21.0774 29.5494 20.4143C28.9517 19.7163 28.3541 19.3673 27.7564 19.3673H22.123V27.3245Z" fill="#FFDF42"/>
            <path d="M16.1495 40.6002V15.1143H14.1583L2.875 29.1848V31.8397H29.424" stroke="url(#paint0_linear_1_16120)" strokeWidth="4"/>
            <path d="M60.911 13.4941H64.4633C65.8757 13.4941 66.943 13.7437 67.6651 14.2428C68.3872 14.7419 68.7483 15.6287 68.7483 16.903C68.7483 17.7632 68.6368 18.4482 68.4138 18.9579C68.1908 19.4677 67.7766 19.8659 67.1713 20.1526L68.9395 26.3969H65.9925L64.5748 20.6146H63.7624V26.3969H60.911V13.4941ZM64.5589 18.9738C65.1323 18.9738 65.5306 18.8252 65.7536 18.5278C65.9872 18.2199 66.104 17.7632 66.104 17.1579C66.104 16.5738 65.9978 16.1384 65.7854 15.8517C65.573 15.5543 65.2067 15.4057 64.6863 15.4057H63.7624V18.9738H64.5589Z" fill="#211A1D"/>
            <path d="M73.6483 13.4941H79.4466V15.4375H76.4997V18.6393H78.7457V20.6146H76.4997V24.4695H79.4785V26.3969H73.6483V13.4941Z" fill="#211A1D"/>
            <path d="M83.9589 13.4941H85.966L88.6102 19.7066V13.4941H90.9678V26.3969H89.0403L86.3961 19.7066V26.3969H83.9589V13.4941Z" fill="#211A1D"/>
            <path d="M97.2367 15.6127H95.2934V13.4941H102.031V15.6127H100.104V26.3969H97.2367V15.6127Z" fill="#211A1D"/>
            <path d="M64.3199 39.4272H60.3535V37.4679L63.7146 29.4235H66.8049V37.4519H67.9996V39.4272H66.8049V42.3263H64.3199V39.4272ZM64.3199 37.4519V32.0837L62.3765 37.4519H64.3199Z" fill="#211A1D"/>
            <path d="M72.4505 29.4235H75.716C76.8311 29.4235 77.7019 29.5616 78.3285 29.8377C78.955 30.1138 79.3957 30.5492 79.6506 31.1439C79.9161 31.728 80.0488 32.5138 80.0488 33.5014V38.1847C80.0488 39.1829 79.9161 39.9794 79.6506 40.5741C79.3957 41.1688 78.955 41.6095 78.3285 41.8962C77.7125 42.183 76.8523 42.3263 75.7479 42.3263H72.4505V29.4235ZM75.7479 40.3511C76.1621 40.3511 76.4647 40.2927 76.6559 40.1759C76.8576 40.0484 76.9851 39.8732 77.0382 39.6502C77.0913 39.4166 77.1178 39.0767 77.1178 38.6307V33.0076C77.1178 32.5935 77.086 32.2802 77.0222 32.0678C76.9691 31.8448 76.8417 31.6802 76.6399 31.574C76.4488 31.4678 76.1461 31.4147 75.732 31.4147H75.3019V40.3511H75.7479Z" fill="#211A1D"/>
            <path d="M86.5993 29.4235H89.8489L92.2542 42.3263H89.6259L89.1958 39.6024H87.3002L86.8542 42.3263H84.1621L86.5993 29.4235ZM88.925 37.898L88.24 32.8643L87.555 37.898H88.925Z" fill="#211A1D"/>
            <path d="M97.7298 37.0537L95.2767 29.4235H97.9688L99.1953 33.5014L100.294 29.4235H102.875L100.47 37.0537V42.3263H97.7298V37.0537Z" fill="#211A1D"/>
            <defs>
                <linearGradient id="paint0_linear_1_16120" x1="18.1407" y1="31.0436" x2="31.4151" y2="31.0436" gradientUnits="userSpaceOnUse">
                <stop stopColor="#211A1D"/>
                <stop offset="1" stopColor="#F0F0F0" stopOpacity="0"/>
                </linearGradient>
            </defs>
            </svg>
            <button className="py-[10px] ftbtn px-6 rounded-full bg-[#ffdf42]">Связаь с администрацией</button>
        </div>
        <p className="fp mt-7">OOO «Название», РБ, . Минск, пр-т Победителей, д.85, 8 эт., офис 845 Зарегистрировано Мингорисполкомом 26.02.14 за номером 192223896</p>
        <div className="pt-[51px] pb-2">
            <div className="text-center flex flex-col gap-5 mb-11 lg:flex-row justify-center lg:mb-[-10px]">
                <p className="fp">Политика конфиденциальности</p>
                <p className="fp">Обработка персональных данных</p>
            </div>
            <div className="flex justify-between">
                <p className="fttp">2019 ©  права защищены</p>
                <p className="fttp"> Разработка сайта «Студия ЯР»</p>
            </div>
        </div>
    </div>
  )
}

export default Foot